In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine

In [4]:
import getpass
password = getpass.getpass()

········

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

1. Select all the actors with the first name ‘Scarlett’.

In [7]:
query = '''SELECT * FROM sakila.actor WHERE first_name = 'Scarlett';'''
pd.read_sql_query(query, engine)

   actor_id first_name last_name         last_update
0        81   SCARLETT     DAMON 2006-02-15 04:34:33
1       124   SCARLETT    BENING 2006-02-15 04:34:33

2. How many films (movies) are available for rent and how many films have been rented?

In [10]:
query = '''SELECT count(distinct(film_id)) FROM sakila.film;'''
pd.read_sql_query(query, engine)

   count(distinct(film_id))
0                      1000

In [9]:
query = '''SELECT COUNT(DISTINCT(film_id)) FROM sakila.inventory 
WHERE inventory_id IN (select inventory_id from sakila.rental);'''
pd.read_sql_query(query, engine)

   COUNT(DISTINCT(film_id))
0                       958

3. What are the shortest and longest movie duration? Name the values max_duration and min_duration.

In [11]:
query = '''SELECT MIN(length) AS min_duration, MAX(length) AS max_duration FROM sakila.film;'''
pd.read_sql_query(query, engine)

   min_duration  max_duration
0            46           185

4. What's the average movie duration expressed in format (hours, minutes)?

In [13]:
query = '''SELECT CONCAT(FLOOR(AVG(length)/60),':',ROUND((AVG(length)-FLOOR(AVG(length)/60)*60),0)) 
AS average_length FROM sakila.film;'''
pd.read_sql_query(query, engine)

  average_length
0           1:55

5. How many distinct (different) actors' last names are there?

In [14]:
query = '''SELECT count(distinct(last_name)) FROM sakila.actor;'''
pd.read_sql_query(query, engine)

   count(distinct(last_name))
0                         121

6. Since how many days has the company been operating (check DATEDIFF() function)?

In [15]:
query = '''SELECT DATEDIFF(MAX(rental_date), MIN(rental_date)) FROM sakila.rental;'''
pd.read_sql_query(query, engine)

   DATEDIFF(MAX(rental_date), MIN(rental_date))
0                                           266

7. Show rental info with additional columns month and weekday. Get 20 results.

In [17]:
query = '''SELECT *, date_format(rental_date, '%%M') AS 'rental_month', WEEKDAY(rental_date) AS 'weekday'
FROM sakila.rental 
LIMIT 20;'''
pd.read_sql_query(query, engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_month,weekday
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,May,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,May,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,May,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,May,1
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,May,1
5,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-15 21:30:53,May,1
6,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2,2006-02-15 21:30:53,May,1
7,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2,2006-02-15 21:30:53,May,1
8,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1,2006-02-15 21:30:53,May,2
9,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2,2006-02-15 21:30:53,May,2
10,11,2005-05-25 00:09:02,4443,142,2005-06-02 20:56:02,2,2006-02-15 21:30:53,May,2
11,12,2005-05-25 00:19:27,1584,261,2005-05-30 05:44:27,2,2006-02-15 21:30:53,May,2
12,13,2005-05-25 00:22:55,2294,334,2005-05-30 04:28:55,1,2006-02-15 21:30:53,May,2
13,14,2005-05-25 00:31:15,2701,446,2005-05-26 02:56:15,1,2006-02-15 21:30:53,May,2
14,15,2005-05-25 00:39:22,3049,319,2005-06-03 03:30:22,1,2006-02-15 21:30:53,May,2
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2,2006-02-15 21:30:53,May,2
16,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1,2006-02-15 21:30:53,May,2
17,18,2005-05-25 01:10:47,3376,19,2005-05-31 06:35:47,2,2006-02-15 21:30:53,May,2
18,19,2005-05-25 01:17:24,1941,456,2005-05-31 06:00:24,1,2006-02-15 21:30:53,May,2
19,20,2005-05-25 01:48:41,3517,185,2005-05-27 02:20:41,2,2006-02-15 21:30:53,May,2

8. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [19]:
query = '''SELECT *, date_format(rental_date, '%%M') AS 'rental_month', WEEKDAY(rental_date) AS 'weekday',
CASE
WHEN WEEKDAY(rental_date) <= 4 then 'workday'
ELSE 'weekend'
END AS 'Day_type'
FROM sakila.rental;'''
pd.read_sql_query(query, engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_month,weekday,Day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,May,1,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,May,1,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,May,1,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,May,1,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,May,1,workday
...,...,...,...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53,August,1,workday
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53,August,1,workday
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53,August,1,workday
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53,August,1,workday
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53,August,1,workday

9. Get release years.

In [20]:
query = '''SELECT distinct(release_year) FROM sakila.film;'''
pd.read_sql_query(query, engine)

   release_year
0          2006

10. Get all films with ARMAGEDDON in the title.

In [22]:
query = '''SELECT * FROM sakila.film
WHERE title LIKE '%%ARMAGEDDON%%';'''
pd.read_sql_query(query, engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
5,844,STEERS ARMAGEDDON,A Stunning Character Study of a Car And a Girl...,2006,1,None,6,4.99,140,16.99,PG,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42

11. Get all films which title ends with APOLLO.

In [23]:
query = '''SELECT * FROM sakila.film
WHERE title LIKE '%%APOLLO';'''
pd.read_sql_query(query, engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,759,SALUTE APOLLO,A Awe-Inspiring Character Study of a Boy And a...,2006,1,None,4,2.99,73,29.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
1,771,SCORPION APOLLO,A Awe-Inspiring Documentary of a Technical Wri...,2006,1,None,3,4.99,137,23.99,NC-17,"Commentaries,Deleted Scenes",2006-02-15 05:03:42
2,878,TEEN APOLLO,A Awe-Inspiring Drama of a Dog And a Man who m...,2006,1,None,3,4.99,74,25.99,G,"Trailers,Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
3,966,WEDDING APOLLO,A Action-Packed Tale of a Student And a Waitre...,2006,1,None,3,0.99,70,14.99,PG,Trailers,2006-02-15 05:03:42
4,974,WILD APOLLO,A Beautiful Story of a Monkey And a Sumo Wrest...,2006,1,None,4,0.99,181,24.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42

12. Get 10 the longest films.

In [24]:
query = '''SELECT * FROM sakila.film ORDER BY length DESC LIMIT 10;'''
pd.read_sql_query(query, engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,817,SOLDIERS EVOLUTION,A Lacklusture Panorama of a A Shark And a Pion...,2006,1,None,7,4.99,185,27.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
1,872,SWEET BROTHERHOOD,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,None,3,2.99,185,27.99,R,Deleted Scenes,2006-02-15 05:03:42
2,141,CHICAGO NORTH,A Fateful Yarn of a Mad Cow And a Waitress who...,2006,1,None,6,4.99,185,11.99,PG-13,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
3,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,2006,1,None,4,2.99,185,26.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
4,349,GANGS PRIDE,A Taut Character Study of a Woman And a A Shar...,2006,1,None,4,2.99,185,27.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
5,212,DARN FORRESTER,A Fateful Story of a A Shark And a Explorer wh...,2006,1,None,7,4.99,185,14.99,G,Deleted Scenes,2006-02-15 05:03:42
6,426,HOME PITY,A Touching Panorama of a Man And a Secret Agen...,2006,1,None,7,4.99,185,15.99,R,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42
7,609,MUSCLE BRIGHT,A Stunning Panorama of a Sumo Wrestler And a H...,2006,1,None,7,2.99,185,23.99,G,Deleted Scenes,2006-02-15 05:03:42
8,182,CONTROL ANTHEM,A Fateful Documentary of a Robot And a Student...,2006,1,None,7,4.99,185,9.99,G,Commentaries,2006-02-15 05:03:42
9,690,POND SEATTLE,A Stunning Drama of a Teacher And a Boat who m...,2006,1,None,7,2.99,185,25.99,PG-13,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

13. How many films include Behind the Scenes content?

In [25]:
query = '''SELECT count(film_id) FROM sakila.film 
WHERE special_features LIKE '%%Behind the scenes%%';'''
pd.read_sql_query(query, engine)

   count(film_id)
0             538